html/lc-1505-minimum-possible-integer-after-at-most-k-adjacent-swaps-on-digits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>1505. 最多 K 次交换相邻数位后得到的最小整数</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">1505. 最多 K 次交换相邻数位后得到的最小整数</h1>
<p>
<a href="https://leetcode-cn.com/problems/minimum-possible-integer-after-at-most-k-adjacent-swaps-on-digits/">https://leetcode-cn.com/problems/minimum-possible-integer-after-at-most-k-adjacent-swaps-on-digits/</a>
</p>

<p>
这题目的一些关键难点我都考虑到了，但是在实现步骤上出现了差错。
</p>
<ul class="org-ul">
<li>首先这题需要使用贪心算法，尽可能地选择靠前的小的数字前移
</li>
<li>但是每次必须重新选择，而不能先将0全部前移，然后将1全部前移，如此下去
</li>
<li>而应该先将一个0前移之后看看下一个0是否可以前移到最开始，否则去测试1是否可以前移到最开始
</li>
<li>这个算法的难点是，如果 <code>nums[i]</code> 上的数字前移之后，那么所有 <code>nums[j] (j &gt; i)</code> 的数字前移的cost都要减1
</li>
</ul>

<p>
所以这个算法的难点是，我们要维护一个数据结构，当前移 <code>nums[j]</code> 这个数字的时候，知道已经有多少个数字(比如k)是 <code>nums[i] (i&lt;j)</code>  的。那么这次移动 <code>nums[j]</code> 这个数字的话，cost就是 <code>j-k</code>.
</p>
<ul class="org-ul">
<li>简单的话我们可以使用一个排序数组+二分搜索，更新时间复杂度是O(n), 查询时间复杂度是O(lgn) [这种方式提交可以过]
</li>
<li>或者是手写二叉树，记录左子树一共有多少个节点，更新和查询时间复杂度都是O(lgn), 但是手写麻烦还有有旋转。
</li>
</ul>

<p>
其实这个问题完全可以转换成为求解前缀和
</p>
<ul class="org-ul">
<li>一开始有个数组 <code>moved[0..n-1]</code> 内容都是0
</li>
<li>如果 <code>nums[i]</code> 移动到最开始的话，那么 <code>moved[i]=1</code>
</li>
<li>对于求解 <code># of nums[i] (i&lt;j)</code> 的话，那么其实就是求解 <code>sum(moved[0..j-1])</code>
</li>
</ul>
<p>
如果将这个问题转换成为前缀和的话，那么又会多了两种数据结构：区间树和Fenwick树，其实是一个思想，但是Fenwick写起来更简单。我之前写过一篇 <a href="binary-indexed-tree.html">BIT/Fenwick树</a> 的文章。
</p>

<p>
代码如下，二分搜索或者是Fenwick可以作为一个抽象策略存在：
</p>

<div class="org-src-container">

<pre class="src src-python"><span class="org-py-def-class">class</span> <span class="org-py-class-name">Solution</span>:
    <span class="org-py-def-class">class</span> <span class="org-py-class-name">BIT</span>:
        <span class="org-py-def-class">def</span> <span class="org-function-name">__init__</span>(<span class="org-py-object-reference">self</span>, n):
            <span class="org-py-object-reference">self</span>.n = n
            <span class="org-py-object-reference">self</span>.values = [<span class="org-py-number">0</span>] * (n + <span class="org-py-number">1</span>)

        <span class="org-py-def-class">def</span> <span class="org-function-name">update</span>(<span class="org-py-object-reference">self</span>, x):
            <span class="org-py-variable-name">x</span> += <span class="org-py-number">1</span>
            <span class="org-py-variable-name">n</span> = <span class="org-py-object-reference">self</span>.n
            <span class="org-keyword">while</span> x &lt;= n:
                <span class="org-py-object-reference">self</span>.values[x] += <span class="org-py-number">1</span>
                <span class="org-py-variable-name">x</span> += (x &amp; -x)

        <span class="org-py-def-class">def</span> <span class="org-function-name">query</span>(<span class="org-py-object-reference">self</span>, x):
            <span class="org-py-variable-name">x</span> += <span class="org-py-number">1</span>
            <span class="org-py-variable-name">ans</span> = <span class="org-py-number">0</span>
            <span class="org-keyword">while</span> x &gt; <span class="org-py-number">0</span>:
                <span class="org-py-variable-name">ans</span> += <span class="org-py-object-reference">self</span>.values[x]
                <span class="org-py-variable-name">x</span> -= (x &amp; -x)
            <span class="org-keyword">return</span> ans

    <span class="org-py-def-class">class</span> <span class="org-py-class-name">BS</span>:
        <span class="org-py-def-class">def</span> <span class="org-function-name">__init__</span>(<span class="org-py-object-reference">self</span>, n):
            <span class="org-py-object-reference">self</span>.bs = []

        <span class="org-py-def-class">def</span> <span class="org-function-name">update</span>(<span class="org-py-object-reference">self</span>, x):
            <span class="org-py-import-from">import</span> bisect
            bisect.insort(<span class="org-py-object-reference">self</span>.bs, x)

        <span class="org-py-def-class">def</span> <span class="org-function-name">query</span>(<span class="org-py-object-reference">self</span>, x):
            <span class="org-py-import-from">import</span> bisect
            <span class="org-keyword">return</span> bisect.bisect(<span class="org-py-object-reference">self</span>.bs, x)

    <span class="org-py-def-class">def</span> <span class="org-function-name">minInteger</span>(<span class="org-py-object-reference">self</span>, num: <span class="org-py-builtins">str</span>, k: <span class="org-py-builtins">int</span>) -&gt; <span class="org-py-builtins">str</span>:

        <span class="org-py-variable-name">qs</span> = [[] <span class="org-keyword">for</span> <span class="org-py-builtins">_</span> <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(<span class="org-py-number">10</span>)]
        <span class="org-py-variable-name">buf</span> = []
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">reversed</span>(range(len(num))):
            <span class="org-py-variable-name">c</span> = <span class="org-py-builtins">int</span>(num[i])
            qs[c].append(i)

        <span class="org-py-variable-name">BSClass</span> = <span class="org-py-object-reference">self</span>.BIT
        <span class="org-py-variable-name">bs</span> = BSClass(len(num))
        <span class="org-keyword">while</span> k <span class="org-keyword">and</span> <span class="org-py-builtins">len</span>(buf) &lt; <span class="org-py-builtins">len</span>(num):
            <span class="org-py-variable-name">ok</span> = <span class="org-py-pseudo-keyword">False</span>
            <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(<span class="org-py-number">10</span>):
                <span class="org-keyword">if</span> <span class="org-keyword">not</span> qs[i]: <span class="org-keyword">continue</span>
                <span class="org-py-variable-name">q</span> = qs[i][-<span class="org-py-number">1</span>]
                <span class="org-py-variable-name">j</span> = bs.query(q)
                <span class="org-comment"># print(q, j)</span>
                <span class="org-keyword">if</span> (q - j) &lt;= k:
                    qs[i].pop()
                    bs.update(q)
                    <span class="org-py-variable-name">k</span> -= (q - j)
                    buf.append(q)
                    <span class="org-py-variable-name">ok</span> = <span class="org-py-pseudo-keyword">True</span>
                    <span class="org-keyword">break</span>
            <span class="org-keyword">if</span> <span class="org-keyword">not</span> ok: <span class="org-keyword">break</span>

        <span class="org-py-variable-name">used</span> = <span class="org-py-builtins">set</span>(buf)
        <span class="org-py-variable-name">ans</span> = []
        <span class="org-keyword">for</span> q <span class="org-keyword">in</span> buf:
            ans.append(num[q])
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-py-builtins">range</span>(len(num)):
            <span class="org-keyword">if</span> i <span class="org-keyword">in</span> used: <span class="org-keyword">continue</span>
            ans.append(num[i])

        <span class="org-py-variable-name">ans</span> = <span class="org-string">''</span>.join(ans)
        <span class="org-keyword">return</span> ans
</pre>
</div>
</div>
</body>
</html>
